export const source = {
  cardFantasyMage: '../src/app/assets/cardFantasyMage.png',
  qBlack: '../src/app/assets/qBlackBg.png',
  qEngland: '../src/app/assets/qEnglandBg.png',
  qModern: '../src/app/assets/qModernBg.png',
  qFantasy: '../src/app/assets/qFantasyBg.png',
}

export const questions = {
  england: ['Чем тебе больше всего\nдосадили родственники?', 'Ты получил приглашение\nна аудиенцию во дворец.\nТвои действия?', 'Что тебе запомнилось\nв утренних газетах?'],
  modern: ['Какую суперспособность\nты бы хотел иметь?', 'В твоём доме отключили\nэлектричество. Твои действия?', 'Звонок. Босс хочет\nтебя видеть через 15 минут.\nТвои действия?'],
  fantasy: ['Тебя преследует монстр.\nТвои действия?', 'Какому заклинанию\nты хотел бы научиться?', 'С какой целью ты бы\nотправился в приключение?'],
  black: [
    'В каком ты настроении?', 'За что тебя наградили?', 'Какой была твоя последняя\nпрочитанная книга?', 
    'О чём ты мечтаешь?', 'Что бы ты заказал на обед?', 'Куда бы ты поехал\nпрямо сейчас?', 
    'Что привлекло твоё внимание\nпо дороге сюда?', 'К тебе ворвались грабители.\nТвои действия?', 'Как выглядит твоё жилище?',
    'Какой у тебя питомец?', 'Что у тебя с собой?', 'Чего ты боишься?',
    'Какое у тебя телосложение?', 'Что на тебе надето?', 'Какие у тебя руки?',
    'Какое ты производишь\nпервое впечатление?', 'Какая на тебе обувь?', 'Как выглядят твоё лицо\nи твоя причёска?'
  ],
}
