export const memoryList = {
  victorian: {
    professions: [
      'Почтальон',
      'Портной',
      'Адмирал',
      'Пекарь',
      'Банкир',
      'Поэт',
      'Механик',
      'Полицейский',
      'Продавец газет',
      'Частный сыщик',
      'Кучер',
      'Химик',
      'Фокусник',
      'Путешественник'
    ],
    secrets: [
      'Подделывает деньги',
      'Клептоман',
      'Отравил дядю ради наследства',
      'Непьющий',
      'Болен тропической лихорадкой',
      'Рассеянный',
      'Посещает публичный дом',
      'Блохастый',
      'Скрывает благородное происхождение',
      'Держит дома змей',
      'Живёт двойной жизнью',
      'Строит подводную лодку',
      'Уволен с работы',
      'Проводит спиритические сеансы'
    ]
  },
  modern: {
    professions: [
      'Стилист',
      'Таксист',
      'Строитель',
      'Журналист',
      'Дрессировщик',
      'Следователь',
      'Блогер',
      'Электрик',
      'Кинорежиссёр',
      'Программист',
      'Фитнес-тренер',
      'Дизайнер',
      'Бармен',
      'Врач скорой помощи',
    ],
    secrets: [
      'Верит в теорию заговора',
      'Многодетный',
      'Состоит в преступной группировке',
      'Жертва шантажа',
      'Снимает видео с котиками',
      'Бывают галлющинации',
      'Навещает родственника в тюрьме',
      'Информатор спецслужб',
      'Страдает от аллергии на шерсть',
      'Шопоголик',
      'Политический активист',
      'Живёт в кредит',
      'Интернет-тролль',
      'Незаконно рисует граффити'
    ]
  },
  fantasy: {
    professions: [
      'Палач',
      'Бард',
      'Стражник',
      'Боевой маг',
      'Драконий всадник',
      'Глашатай',
      'Конюх',
      'Инквизитор',
      'Шаман',
      'Трактирщик',
      'Кузнец',
      'Берсерк',
      'Разбойник',
      'Некромант'
    ],
    secrets: [
      'Превратил брата в овцу',
      'Воскрес из мёртвых',
      'Считает, что волшебников не существует',
      'Охотится на оборотней',
      'Нашёл лампу с джинном',
      'Одержим демоном',
      'Чемпион рыцарского турнира',
      'Прибыл из другого мира',
      'Убеждён, что его сосед - вампир',
      'Убил сборщика налогов',
      'Купил проклятый меч',
      'Прихвостень Тёмного властелина',
      'Спит в гробу',
      'Ищет жертву для ритуала'
    ]
  }
}

export const source = {
  cardFantasyMage: '../src/app/assets/cardFantasyMage.png',
  qBlack: '../src/app/assets/qBlackBg.png',
  qEngland: '../src/app/assets/qEnglandBg.png',
  qModern: '../src/app/assets/qModernBg.png',
  qFantasy: '../src/app/assets/qFantasyBg.png',
}

export const questions = {
  england: ['Чем тебе больше всего\nдосадили родственники?', 'Ты получил приглашение\nна аудиенцию во дворец.\nТвои действия?', 'Что тебе запомнилось\nв утренних газетах?'],
  modern: ['Какую суперспособность\nты бы хотел иметь?', 'В твоём доме отключили\nэлектричество. Твои действия?', 'Звонок. Босс хочет\nтебя видеть через 15 минут.\nТвои действия?'],
  fantasy: ['Тебя преследует монстр.\nТвои действия?', 'Какому заклинанию\nты хотел бы научиться?', 'С какой целью ты бы\nотправился в приключение?'],
  black: [
    'В каком ты настроении?', 'За что тебя наградили?', 'Какой была твоя последняя\nпрочитанная книга?', 
    'О чём ты мечтаешь?', 'Что бы ты заказал на обед?', 'Куда бы ты поехал\nпрямо сейчас?', 
    'Что привлекло твоё внимание\nпо дороге сюда?', 'К тебе ворвались грабители.\nТвои действия?', 'Как выглядит твоё жилище?',
    'Какой у тебя питомец?', 'Что у тебя с собой?', 'Чего ты боишься?',
    'Какое у тебя телосложение?', 'Что на тебе надето?', 'Какие у тебя руки?',
    'Какое ты производишь\nпервое впечатление?', 'Какая на тебе обувь?', 'Как выглядят твоё лицо\nи твоя причёска?'
  ],
}
